//System Setting Up//
Here we will use Routers as gateway.
========================================
Step-1: Set ip on every PC.
Step-2: Set Subnet Mask 192.168.5.1 on every Computer in Network A .
Step-3: Set Subnet Mask 192.168.6.1 on every Computer in Network B .
Step-4: Set ip on Gig0/0/0 port of Router1 as 192.168.5.1 and Gig0/0/1 as 10.10.10.1 . 
Step-5: Set ip on Gig0/0/0 port of Router2 as 10.10.10.2 and Gig0/0/1 as 11.11.11.2 .
Step-6: Set ip on Gig0/0/0 port of Router3 as 192.168.6.1 and Gig0/0/1 as 11.11.11.1 .

Now the the system is ready to Command Line Interface (CLI) for every Router. 

//****************** CLI for Router1 **********************
// Select Router1 and follow the CLI Command
// Setting ip on port gig0/0/0 For Router1
Router> enable	
Router# Configure terminal
Router(config)# interface gigabitEthernet 0/0/0
Router(config-if)# ip address 192.168.5.1 255.255.255.0
Router(config-if)# no shutdown
Router(config-if)# exit 
//Setting ip on port gig0/0/1 For Router1
Router(config)# interface gigabitEthernet 0/0/0
Router(config-if)# ip address 10.10.10.1 255.255.255.0
Router(config-if)# no shutdown
Router(config-if)# exit 
Router(config)# do write memory
//****************** CLI for Router3 **********************
// Select Router3 and follow the CLI Command
// Setting ip on port gig0/0/0 For Router3
Router> enable	
Router# Configure terminal
Router(config)# interface gigabitEthernet 0/0/0
Router(config-if)# ip address 192.168.6.1 255.255.255.0
Router(config-if)# no shutdown
Router(config-if)# exit 
//Setting ip on port gig0/0/1 For Router3
Router(config)# interface gigabitEthernet 0/0/0
Router(config-if)# ip address 11.11.11.1 255.255.255.0
Router(config-if)# no shutdown
Router(config-if)# exit 
Router(config)# do write memory
//****************** CLI for Router2 **********************
// Select Router2 and follow the CLI Command
// Setting ip on port gig0/0/0 For Router2
Router> enable	
Router# Configure terminal
Router(config)# interface gigabitEthernet 0/0/0
Router(config-if)# ip address 10.10.10.2 255.255.255.0
Router(config-if)# no shutdown
Router(config-if)# exit 
//Setting ip on port gig0/0/1 For Router2
Router(config)# interface gigabitEthernet 0/0/0
Router(config-if)# ip address 11.11.11.2 255.255.255.0
Router(config-if)# no shutdown
Router(config-if)# exit 
Router(config)# do write memory

//************************ ip route in config mode ********************
// select Router1 and command 
Router(config)# ip route 192.168.6.0 255.255.255.0 10.10.10.2
// select Router3 and command 
Router(config)# ip route 192.168.5.0 255.255.255.0 11.11.11.2
// select Router2 and command 
Router(config)# ip route 192.168.5.0 255.255.255.0 10.10.10.1
Router(config)# ip route 192.168.6.0 255.255.255.0 11.11.11.1

//************** Thank you *****************



